In [4]:
# Ignore Warnings.
import warnings
warnings.filterwarnings("ignore")

# Dependencies
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import datetime as dt
import scipy.stats as st
import re

In [5]:
# Import the data
Hurricane_df = pd.read_csv('new_data_atlantic.csv')
Hurricane_df

,Unnamed: 0,ID,Name,Date,Time,Status,Latitude,Longitude,Maximum Wind
0,0,AL011851,UNNAMED,1851-06-25,0,HU,28.0N,94.8W,80
1,1,AL011851,UNNAMED,1851-06-25,600,HU,28.0N,95.4W,80
2,2,AL011851,UNNAMED,1851-06-25,1200,HU,28.0N,96.0W,80
3,3,AL011851,UNNAMED,1851-06-25,1800,HU,28.1N,96.5W,80
4,4,AL011851,UNNAMED,1851-06-25,2100,HU,28.2N,96.8W,80
...,...,...,...,...,...,...,...,...,...
49100,49100,AL122015,KATE,2015-11-12,1200,EX,41.3N,50.4W,55
49101,49101,AL122015,KATE,2015-11-12,1800,EX,41.9N,49.9W,55
49102,49102,AL122015,KATE,2015-11-13,0,EX,41.5N,49.2W,50
49103,49103,AL122015,KATE,2015-11-13,600,EX,40.8N,47.5W,45
49104,49104,AL122015,KATE,2015-11-13,1200,EX,40.7N,45.4W,45

In [14]:
new_data = Hurricane_df.groupby(['ID'])
new_data = new_data[['Date', 'Maximum Wind', 'Name']]
new_data.first()

                Date  Maximum Wind                 Name
ID
AL011851  1851-06-25            80              UNNAMED
AL011852  1852-08-19            60              UNNAMED
AL011853  1853-08-05            50              UNNAMED
AL011854  1854-06-25            60              UNNAMED
AL011855  1855-08-06            90              UNNAMED
...              ...           ...                  ...
AL282005  2005-11-14            30                GAMMA
AL291969  1969-11-21            45               MARTHA
AL292005  2005-11-19            25                DELTA
AL302005  2005-11-29            45              EPSILON
AL312005  2005-12-30            30                 ZETA

[1814 rows x 3 columns]

In [20]:
#need to find max for each ID
maxwnd_df=new_data.max()
maxwnd_df

                Date  Maximum Wind                 Name
ID
AL011851  1851-06-28            80              UNNAMED
AL011852  1852-08-30           100              UNNAMED
AL011853  1853-08-05            50              UNNAMED
AL011854  1854-06-27            70              UNNAMED
AL011855  1855-08-06            90              UNNAMED
...              ...           ...                  ...
AL282005  2005-11-22            45                GAMMA
AL291969  1969-11-25            80               MARTHA
AL292005  2005-11-29            60                DELTA
AL302005  2005-12-09            75              EPSILON
AL312005  2006-01-07            55                 ZETA

[1814 rows x 3 columns]

In [ ]:
maxwnd